; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v2 - type_3 ?v1 - type_1)
 	      (pred_2 ?v4 - object ?v1 - type_1)
	      (pred_3 ?v2 - type_3 ?v3 - type_2)
	      (pred_1 ?v2 - type_3 ?v4 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v2 - type_3 ?v5 ?v7 - type_1)
       :precondition (and  (pred_4 ?v2 ?v5))
       :effect (and  (pred_4 ?v2 ?v7)
		     (not (pred_4 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v6 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v8) (pred_4 ?v2 ?v8) (pred_3 ?v2 ?v3))
       :effect (and (pred_1 ?v2 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v8)) 
		    (not (pred_3 ?v2 ?v3))))

   (:action op_1
       :parameters (?v2 - type_3 ?v6 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v6 ?v3) (pred_4 ?v2 ?v8))
       :effect (and (pred_2 ?v6 ?v8)
		    (pred_3 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v6 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_3
obj_05 obj_03 - type_2
obj_08 obj_04 obj_10 obj_07 - type_1
obj_09 obj_01 obj_02 - object)
(:init
(pred_4 obj_06 obj_10)
(pred_3 obj_06 obj_05)
(pred_3 obj_06 obj_03)
(pred_2 obj_09 obj_07)
(pred_2 obj_01 obj_07)
(pred_2 obj_02 obj_04)
)
(:goal
(and
(pred_2 obj_09 obj_10)
(pred_2 obj_01 obj_08)
(pred_2 obj_02 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_06 ?b obj_03))))
)
)

; plan
1. (op_3 obj_06 obj_10 obj_04)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_04)
   goals met: 0 of 3
2. (op_2 obj_06 obj_02 obj_04 obj_05)
   deleted: (pred_2 obj_02 obj_04) (pred_3 obj_06 obj_05)
   added: (pred_1 obj_06 obj_02 obj_05)
   goals met: 0 of 3
3. (op_3 obj_06 obj_04 obj_08)
   deleted: (pred_4 obj_06 obj_04)
   added: (pred_4 obj_06 obj_08)
   goals met: 0 of 3
4. (op_1 obj_06 obj_02 obj_08 obj_05)
   deleted: (pred_1 obj_06 obj_02 obj_05)
   added: (pred_2 obj_02 obj_08) (pred_3 obj_06 obj_05)
   goals met: 1 of 3
5. (op_3 obj_06 obj_08 obj_07)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_07)
   goals met: 1 of 3
6. (op_2 obj_06 obj_09 obj_07 obj_05)
   deleted: (pred_2 obj_09 obj_07) (pred_3 obj_06 obj_05)
   added: (pred_1 obj_06 obj_09 obj_05)
   goals met: 1 of 3
7. (op_3 obj_06 obj_07 obj_10)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_10)
   goals met: 1 of 3
8. (op_1 obj_06 obj_09 obj_10 obj_05)
   deleted: (pred_1 obj_06 obj_09 obj_05)
   added: (pred_2 obj_09 obj_10) (pred_3 obj_06 obj_05)
   goals met: 2 of 3
9. (op_3 obj_06 obj_10 obj_07)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_07)
   goals met: 2 of 3
10. (op_2 obj_06 obj_01 obj_07 obj_05)
   deleted: (pred_2 obj_01 obj_07) (pred_3 obj_06 obj_05)
   added: (pred_1 obj_06 obj_01 obj_05)
   goals met: 2 of 3
11. (op_3 obj_06 obj_07 obj_08)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_08)
   goals met: 2 of 3
12. (op_1 obj_06 obj_01 obj_08 obj_05)
   deleted: (pred_1 obj_06 obj_01 obj_05)
   added: (pred_2 obj_01 obj_08) (pred_3 obj_06 obj_05)
   goals met: 3 of 3
